<a href="https://colab.research.google.com/github/muhamad-rizal/praktikum-02/blob/main/Untitled02.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd #proses pemanggilan file
import numpy as np
path_="/content/drive/My Drive/Machine Learning/Dataset/Praktikum02/praktikum-02.csv"
dataset=pd.read_csv(path_)
dataset

In [ ]:
dataset.head() #Printah untuk menampilkan 5 data awal

In [22]:
import matplotlib.pyplot as plt
%matplotlib inline

In [ ]:
plt.scatter(dataset['Mileage'],dataset['sell price($)'])

In [ ]:
plt.scatter(dataset['Age(yrs)'],dataset['sell price($)'])

In [24]:
X=dataset[['Mileage','Age(yrs)']]
y=dataset['sell price($)']

In [ ]:
X

In [ ]:
y

In [43]:
from sklearn.model_selection import train_test_split

In [44]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2)

In [ ]:
len(X_train)

In [ ]:
len(X_test)

In [ ]:
X_train

In [ ]:
X_test

In [ ]:
y_train

In [ ]:
y_test

In [49]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.2,random_state=10)

In [ ]:
X_train

In [ ]:
from sklearn.model_selection import train_test_split

In [ ]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.4)

In [ ]:
len(X_train)

In [ ]:
len(X_test)

In [ ]:
X_train

In [ ]:
X_test

In [ ]:
y_train

In [ ]:
y_test

In [27]:
X_train,X_test,y_train,y_test=train_test_split(X,y,random_state=10)

In [ ]:
X_train

In [51]:
import pandas as pd #proses pemanggilan file
import numpy as np
path_="/content/drive/My Drive/Machine Learning/Dataset/Praktikum02/praktikum-02 tambah dataa.csv"
dataset=pd.read_csv(path_)
dataset

    Mileage  Age(yrs)  sell price($)
0     69000         6           1800
1     35000         3          34000
2     57000         5          26100
3     22500         2          40000
4     46000         4          31500
..      ...       ...            ...
74    52000         5          32000
75    72000         6          19300
76    91000         8          12000
77    67000         6          22000
78    83000         7          18700

[79 rows x 3 columns]

In [52]:
X=dataset[['Mileage','Age(yrs)']]
y=dataset['sell price($)']

In [53]:
X

    Mileage  Age(yrs)
0     69000         6
1     35000         3
2     57000         5
3     22500         2
4     46000         4
..      ...       ...
74    52000         5
75    72000         6
76    91000         8
77    67000         6
78    83000         7

[79 rows x 2 columns]

In [54]:
y

0      1800
1     34000
2     26100
3     40000
4     31500
      ...
74    32000
75    19300
76    12000
77    22000
78    18700
Name: sell price($), Length: 79, dtype: int64

In [55]:
from sklearn.model_selection import train_test_split

In [66]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size=0.1)

In [67]:
len(X_train)

71

In [68]:
len(X_test)

8

In [69]:
X_train

    Mileage  Age(yrs)
38    56778         6
19    52000         5
61    28000         2
1     35000         3
14    82450         7
..      ...       ...
75    72000         6
47    34698         1
13    58780         4
51    52000         5
25    98760         6

[71 rows x 2 columns]

In [70]:
X_test

    Mileage  Age(yrs)
74    52000         5
70    34698         1
18    87600         8
77    67000         6
71    45688         2
59    82450         7
26    21349         6
57    95000         5